package ru.prusov.TelegramBotConstructionHelper.constants;

public class TextConstants {

    public static final String RESOURCE_PATH = "TelegramBotConstructionHelper/src/main/resources/images/";
    public static final String LOGO_IMAGE_PATH = "logo.jpg";

    public static final String UNKNOWN_START_MESSAGE = "Я вас не понял. Начните с /start";
    public static final String START_MESSAGE = """
            👋 Приветствую вас в нашем строительном помощнике!
            🏡 Мы — СК «Дом на Холме», и мы специализируемся на строительстве качественных и уютных частных домов. Здесь вы можете:
            1. Узнать о наших услугах и проектах.
            2. Получить предварительный расчет стоимости строительства.
            3. Задать любые вопросы о процессе и материалах.
            4. Оставить заявку на консультацию.
            🤔 Как я могу помочь вам сегодня?
            """;
    public static final String CONSTRUCTION_MESSAGE = "раздел по строительству находится в разработке";
    public static final String ENGINEERING_MESSAGE = "раздел по инженерным сетям находится в разработке";
    public static final String AUTOMATIZATION_MESSAGE = "раздел по автоматике и системам управления находится в разработке";
    public static final String LOAD_LOGO_MESSAGE = "Загрузите новое изображение логотипа ";
}
